In [1]:
import pandas as pd

In [2]:
nifty = pd.read_csv('nifty.csv')

In [3]:
data = pd.read_csv('data.csv')

In [13]:
nifty.tail()

            Date     Open     High      Low    Close
244  20 Jan 2022  8607.55  8621.10  8507.50  8552.40
245  19 Jan 2022  8670.00  8670.00  8572.30  8611.55
246  18 Jan 2022  8805.20  8813.25  8651.80  8666.35
247  17 Jan 2022  8755.20  8790.90  8747.95  8783.10
248  14 Jan 2022  8717.20  8766.75  8690.40  8753.40

In [14]:
#columns
nifty.columns

Index(['Date', 'Open', 'High', 'Low', 'Close'], dtype='object')

In [16]:
nifty.describe()

              Open        High          Low       Close
count   249.000000   249.00000   249.000000   249.00000
mean   8236.408635  8276.49759  8178.902209  8228.90502
std     417.435663   408.80345   421.545525   415.14246
min    7238.600000  7259.05000  7145.350000  7198.40000
25%    7886.350000  7948.95000  7842.550000  7892.05000
50%    8311.700000  8349.35000  8256.400000  8299.50000
75%    8558.350000  8590.95000  8510.250000  8552.40000
max    8929.900000  8930.90000  8892.300000  8909.90000

In [17]:
nifty.head(2)

          Date     Open    High      Low    Close
0  13 Jan 2023  8521.95  8562.7  8477.35  8549.50
1  12 Jan 2023  8541.05  8550.7  8470.40  8512.35

In [29]:
nifty.isnull().sum()

Date     0
Open     0
High     0
Low      0
Close    0
dtype: int64

In [30]:
print(f'the shape of nifty data is {nifty.shape}')

the shape of nifty data is (249, 5)

In [33]:
print(f'the shape of nifty data is {nifty.size}')

the shape of nifty data is 1245

In [39]:
nifty[['Date']].describe()

               Date
count           249
unique          249
top     13 Jan 2023
freq              1

In [44]:
nifty[['Date','Open']].head(3)

          Date     Open
0  13 Jan 2023  8521.95
1  12 Jan 2023  8541.05
2  11 Jan 2023  8547.65

In [45]:
nifty['Date'].values

array(['13 Jan 2023', '12 Jan 2023', '11 Jan 2023', '10 Jan 2023',
       '09 Jan 2023', '06 Jan 2023', '05 Jan 2023', '04 Jan 2023',
       '03 Jan 2023', '02 Jan 2023', '30 Dec 2022', '29 Dec 2022',
       '28 Dec 2022', '27 Dec 2022', '26 Dec 2022', '23 Dec 2022',
       '22 Dec 2022', '21 Dec 2022', '20 Dec 2022', '19 Dec 2022',
       '16 Dec 2022', '15 Dec 2022', '14 Dec 2022', '13 Dec 2022',
       '12 Dec 2022', '09 Dec 2022', '08 Dec 2022', '07 Dec 2022',
       '06 Dec 2022', '05 Dec 2022', '02 Dec 2022', '01 Dec 2022',
       '30 Nov 2022', '29 Nov 2022', '28 Nov 2022', '25 Nov 2022',
       '24 Nov 2022', '23 Nov 2022', '22 Nov 2022', '21 Nov 2022',
       '18 Nov 2022', '17 Nov 2022', '16 Nov 2022', '15 Nov 2022',
       '14 Nov 2022', '11 Nov 2022', '10 Nov 2022', '09 Nov 2022',
       '07 Nov 2022', '04 Nov 2022', '03 Nov 2022', '02 Nov 2022',
       '01 Nov 2022', '31 Oct 2022', '28 Oct 2022', '27 Oct 2022',
       '25 Oct 2022', '24 Oct 2022', '21 Oct 2022', '20 Oct 2022',
       '19 Oct 2022', '18 Oct 2022', '17 Oct 2022', '14 Oct 2022',
       '13 Oct 2022', '12 Oct 2022', '11 Oct 2022', '10 Oct 2022',
       '07 Oct 2022', '06 Oct 2022', '04 Oct 2022', '03 Oct 2022',
       '30 Sep 2022', '29 Sep 2022', '28 Sep 2022', '27 Sep 2022',
       '26 Sep 2022', '23 Sep 2022', '22 Sep 2022', '21 Sep 2022',
       '20 Sep 2022', '19 Sep 2022', '16 Sep 2022', '15 Sep 2022',
       '14 Sep 2022', '13 Sep 2022', '12 Sep 2022', '09 Sep 2022',
       '08 Sep 2022', '07 Sep 2022', '06 Sep 2022', '05 Sep 2022',
       '02 Sep 2022', '01 Sep 2022', '30 Aug 2022', '29 Aug 2022',
       '26 Aug 2022', '25 Aug 2022', '24 Aug 2022', '23 Aug 2022',
       '22 Aug 2022', '19 Aug 2022', '18 Aug 2022', '17 Aug 2022',
       '16 Aug 2022', '12 Aug 2022', '11 Aug 2022', '10 Aug 2022',
       '08 Aug 2022', '05 Aug 2022', '04 Aug 2022', '03 Aug 2022',
       '02 Aug 2022', '01 Aug 2022', '29 Jul 2022', '28 Jul 2022',
       '27 Jul 2022', '26 Jul 2022', '25 Jul 2022', '22 Jul 2022',
       '21 Jul 2022', '20 Jul 2022', '19 Jul 2022', '18 Jul 2022',
       '15 Jul 2022', '14 Jul 2022', '13 Jul 2022', '12 Jul 2022',
       '11 Jul 2022', '08 Jul 2022', '07 Jul 2022', '06 Jul 2022',
       '05 Jul 2022', '04 Jul 2022', '01 Jul 2022', '30 Jun 2022',
       '29 Jun 2022', '28 Jun 2022', '27 Jun 2022', '24 Jun 2022',
       '23 Jun 2022', '22 Jun 2022', '21 Jun 2022', '20 Jun 2022',
       '17 Jun 2022', '16 Jun 2022', '15 Jun 2022', '14 Jun 2022',
       '13 Jun 2022', '10 Jun 2022', '09 Jun 2022', '08 Jun 2022',
       '07 Jun 2022', '06 Jun 2022', '03 Jun 2022', '02 Jun 2022',
       '01 Jun 2022', '31 May 2022', '30 May 2022', '27 May 2022',
       '26 May 2022', '25 May 2022', '24 May 2022', '23 May 2022',
       '20 May 2022', '19 May 2022', '18 May 2022', '17 May 2022',
       '16 May 2022', '13 May 2022', '12 May 2022', '11 May 2022',
       '10 May 2022', '09 May 2022', '06 May 2022', '05 May 2022',
       '04 May 2022', '02 May 2022', '29 Apr 2022', '28 Apr 2022',
       '27 Apr 2022', '26 Apr 2022', '25 Apr 2022', '22 Apr 2022',
       '21 Apr 2022', '20 Apr 2022', '19 Apr 2022', '18 Apr 2022',
       '13 Apr 2022', '12 Apr 2022', '11 Apr 2022', '08 Apr 2022',
       '07 Apr 2022', '06 Apr 2022', '05 Apr 2022', '04 Apr 2022',
       '01 Apr 2022', '31 Mar 2022', '30 Mar 2022', '29 Mar 2022',
       '28 Mar 2022', '25 Mar 2022', '24 Mar 2022', '23 Mar 2022',
       '22 Mar 2022', '21 Mar 2022', '17 Mar 2022', '16 Mar 2022',
       '15 Mar 2022', '14 Mar 2022', '11 Mar 2022', '10 Mar 2022',
       '09 Mar 2022', '08 Mar 2022', '07 Mar 2022', '04 Mar 2022',
       '03 Mar 2022', '02 Mar 2022', '28 Feb 2022', '25 Feb 2022',
       '24 Feb 2022', '23 Feb 2022', '22 Feb 2022', '21 Feb 2022',
       '18 Feb 2022', '17 Feb 2022', '16 Feb 2022', '15 Feb 2022',
       '14 Feb 2022', '11 Feb 2022', '10 Feb 2022', '09 Feb 2022',
       '08 Feb 2022', '07 Feb 2022', '04 Feb 2022', '03 Feb 2022',
       '02 Feb 2022', '01 Feb 2022', '31 Jan 2022', '28 Jan 2022',
       '27 Jan 2022', '25 Jan 2022', '24 Jan 2022', '21 Jan 2022',
       '20 Jan 2022', '19 Jan 2022', '18 Jan 2022', '17 Jan 2022',
       '14 Jan 2022'], dtype=object)

In [50]:
nifty['Open'].min()

7238.6

In [59]:
nifty.sort_values(by = ['Close','Open'] , ascending=[False,False])

            Date     Open     High      Low    Close
31   01 Dec 2022  8929.90  8930.90  8892.30  8909.90
29   05 Dec 2022  8908.35  8911.00  8846.95  8893.45
22   14 Dec 2022  8888.45  8905.65  8881.15  8892.10
30   02 Dec 2022  8896.00  8903.30  8859.65  8889.95
32   30 Nov 2022  8811.40  8901.70  8808.15  8877.00
..           ...      ...      ...      ...      ...
140  23 Jun 2022  7274.40  7357.75  7240.80  7328.00
145  16 Jun 2022  7517.80  7528.50  7268.20  7281.70
141  22 Jun 2022  7326.80  7331.60  7245.00  7255.25
144  17 Jun 2022  7238.60  7293.95  7177.45  7228.70
143  20 Jun 2022  7246.05  7259.05  7145.35  7198.40

[249 rows x 5 columns]